; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 11372)
	(= (fuel plane1) 607)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city0)
	(= (capacity plane2) 7449)
	(= (fuel plane2) 2739)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city1)
	(= (capacity plane3) 12577)
	(= (fuel plane3) 2833)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city1)
	(= (capacity plane4) 12011)
	(= (fuel plane4) 2007)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at plane5 city8)
	(= (capacity plane5) 2875)
	(= (fuel plane5) 460)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 3)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city2)
	(at person2 city6)
	(at person3 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 927)
	(= (distance city0 city2) 536)
	(= (distance city0 city3) 780)
	(= (distance city0 city4) 624)
	(= (distance city0 city5) 997)
	(= (distance city0 city6) 997)
	(= (distance city0 city7) 513)
	(= (distance city0 city8) 769)
	(= (distance city0 city9) 623)
	(= (distance city1 city0) 927)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 865)
	(= (distance city1 city3) 558)
	(= (distance city1 city4) 989)
	(= (distance city1 city5) 628)
	(= (distance city1 city6) 744)
	(= (distance city1 city7) 946)
	(= (distance city1 city8) 608)
	(= (distance city1 city9) 905)
	(= (distance city2 city0) 536)
	(= (distance city2 city1) 865)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 714)
	(= (distance city2 city4) 548)
	(= (distance city2 city5) 980)
	(= (distance city2 city6) 935)
	(= (distance city2 city7) 569)
	(= (distance city2 city8) 870)
	(= (distance city2 city9) 838)
	(= (distance city3 city0) 780)
	(= (distance city3 city1) 558)
	(= (distance city3 city2) 714)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 528)
	(= (distance city3 city5) 766)
	(= (distance city3 city6) 847)
	(= (distance city3 city7) 613)
	(= (distance city3 city8) 860)
	(= (distance city3 city9) 878)
	(= (distance city4 city0) 624)
	(= (distance city4 city1) 989)
	(= (distance city4 city2) 548)
	(= (distance city4 city3) 528)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 904)
	(= (distance city4 city6) 787)
	(= (distance city4 city7) 915)
	(= (distance city4 city8) 685)
	(= (distance city4 city9) 911)
	(= (distance city5 city0) 997)
	(= (distance city5 city1) 628)
	(= (distance city5 city2) 980)
	(= (distance city5 city3) 766)
	(= (distance city5 city4) 904)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 912)
	(= (distance city5 city7) 682)
	(= (distance city5 city8) 925)
	(= (distance city5 city9) 682)
	(= (distance city6 city0) 997)
	(= (distance city6 city1) 744)
	(= (distance city6 city2) 935)
	(= (distance city6 city3) 847)
	(= (distance city6 city4) 787)
	(= (distance city6 city5) 912)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 806)
	(= (distance city6 city8) 790)
	(= (distance city6 city9) 740)
	(= (distance city7 city0) 513)
	(= (distance city7 city1) 946)
	(= (distance city7 city2) 569)
	(= (distance city7 city3) 613)
	(= (distance city7 city4) 915)
	(= (distance city7 city5) 682)
	(= (distance city7 city6) 806)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 795)
	(= (distance city7 city9) 918)
	(= (distance city8 city0) 769)
	(= (distance city8 city1) 608)
	(= (distance city8 city2) 870)
	(= (distance city8 city3) 860)
	(= (distance city8 city4) 685)
	(= (distance city8 city5) 925)
	(= (distance city8 city6) 790)
	(= (distance city8 city7) 795)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 984)
	(= (distance city9 city0) 623)
	(= (distance city9 city1) 905)
	(= (distance city9 city2) 838)
	(= (distance city9 city3) 878)
	(= (distance city9 city4) 911)
	(= (distance city9 city5) 682)
	(= (distance city9 city6) 740)
	(= (distance city9 city7) 918)
	(= (distance city9 city8) 984)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city8)
	(at person2 city1)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1608, (fuel plane2) from 2739 to 1131
   goals met: 0 of 2
2. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 2
3. (refuel plane2 city2)
   changed: (fuel plane2) from 1131 to 7449
   goals met: 0 of 2
4. (fly plane2 city2 city8)
   deleted: (at plane2 city2)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 1608 to 4218, (fuel plane2) from 7449 to 4839
   goals met: 0 of 2
5. (debark person1 plane2 city8)
   deleted: (in person1 plane2)
   added: (at person1 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 1 of 2
6. (fly plane2 city8 city6)
   deleted: (at plane2 city8)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 4218 to 6588, (fuel plane2) from 4839 to 2469
   goals met: 1 of 2
7. (board person2 plane2 city6)
   deleted: (at person2 city6)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 2
8. (fly plane2 city6 city1)
   deleted: (at plane2 city6)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 6588 to 8820, (fuel plane2) from 2469 to 237
   goals met: 1 of 2
9. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 2
